[
      {
        "nom": "<code><header></code>",
        "description": "L’élément <code><header></code> définit l’en-tête d’un document ou d’une section. Il peut être utilisé pour contenir une introduction ou des liens de navigation.<br>Vous pouvez avoir plusieurs éléments <code><header></code> dans un même document.",
        "attributs": [
          "id",
          "class"
        ]
      },
      {
        "nom": "<code><footer></code>",
        "description": "La balise <code><footer></code> définit un pied de page d’un document ou d’un élément <code><article></code>.<br>Un élément <code><footer></code> doit contenir des informations sur l’élément auquel il appartient. <br>Un pied de page contient généralement l’auteur du document, les informations de copyright, des liens vers des conditions d’utilisation, informations de contact, etc … <br>Vous pouvez avoir plusieurs éléments <code><footer></code> dans un seul document.",
        "attributs": [
          "id",
          "class"
        ]
      },
      {
        "nom": "<code><div></code>",
        "description": "La balise <code><div></code> définit une division ou une section, appelé aussi calque, dans un document HTML.<br>La balise <code><div></code> est utilisée pour regrouper des éléments sous forme de bloc et ainsi pouvoir les formater en CSS.<br>Remarque : Les navigateurs placent toujours un saut de ligne avant et après un élément <code><div></code>.",
        "attributs": [
          "id",
          "class"
        ]
      },
      {
        "nom": "<code><section></code>",
        "description": "L'élément HTML <strong><code>section</code></strong> représente une section générique d'un document, par exemple un groupe de contenu thématique. Une section commence généralement avec un titre.",
        "attributs": [
          "id",
          "class"
        ]
      },
      {
        "nom": "<code><h1><code>",
        "description": "Les éléments <strong><code>h1</code></strong> à <strong><code>h6</code></strong> représentent six niveaux de titres dans un document, <code>h1</code> est le plus important et <code>h6</code> est le moins important. Un élément de titre décrit brièvement le sujet de la section qu'il introduit.",
        "attributs": [
          "id",
          "class"
        ]
      },
      {
        "nom": "<code><a></code>",
        "description": "La balise <code><a></code> définit un lien hypertexte, qui est utilisé pour relier une page à l’autre.<br>L’attribut le plus important de la balise <code><a></code> est l’attribut href, qui indique la destination du lien.<br>Par défaut, les liens apparaissent dans tous les navigateurs suivant cette ordre : Un lien non visité est souligné et bleu, un lien visité est souligné et violet, Un lien actif est souligné et rouge. <br>Vous pouvez changer le style de vos liens grâce au CSS (Feuille de style).",
        "attributs": [
          "href",
          "id",
          "class"
        ]
      },
      {
        "nom": "<code><img></code>",
        "description": "Dans l'exemple qui précède, on utilise l'élément <code>img</code> simplement. L'attribut <code>src</code> est obligatoire et contient le chemin de l'image qu'on souhaite afficher. L'attribut <code>alt</code> n'est pas obligatoire mais recommandé et contient une description textuelle de l'image ; il est recommandé pour des raisons d'accessibilité et sera utilisé par les lecteurs d'écran ou sera affiché si l'image ne peut pas être chargée.",
        "attributs": [
          "src",
          "alt",
          "id",
          "class"
        ]
      },
      {
        "nom": "<code><nav><code>",
        "description": "L'élément HTML <strong>nav</strong> représente une section d'une page ayant des liens vers d'autres pages ou des fragments de cette page. Autrement dit, c'est une section destinée à la navigation dans un document (avec des menus, des tables des matières, des index, etc.).",
        "attributs": [
          "id",
          "class"
        ]
      },
      {
        "nom": "<code><li><code>",
        "description": "L'élément HTML <code><li></code> est utilisé pour représenter un élément dans une liste. Il doit être contenu dans un élément parent : une liste ordonnée <code><ol></code>, une liste non ordonnée <code><ul></code> ou un menu <code><menu></code>. Dans les menus et les listes non ordonnées, les éléments de liste sont habituellement affichés en utilisant des puces. Dans les listes ordonnées, ils sont habituellement affichés avec compteur croissant à gauche, tel qu'un nombre ou une lettre.",
        "attributs": [
          "id",
          "class",
          "value",
          "type"
        ]
      }
    ]